app/controllers/api/v1/login_controller.rb

SELECT "users".* FROM "users" WHERE (lower(username) = 'benben') LIMIT $1  [["LIMIT", 1]]
---
      def create
          user = User.find_by("lower(username) = ?", params[:username].downcase)