app/controllers/api/v1/transactions_controller.rb

SELECT "transactions".* FROM "transactions"
---
      def index
          allTransactions = Transaction.all

INSERT INTO "transactions" ("user_id", "drawing_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["drawing_id", 2], ["created_at", "2019-12-13 20:36:27.004940"], ["updated_at", "2019-12-13 20:36:27.004940"]]
---
      def create
          transaction = Transaction.create(transaction_params)