app/controllers/transactions_controller.rb

    def create
        transaction = Transaction.create(transaction_params)
---
INSERT INTO "transactions" ("user_id", "drawing_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["drawing_id", 4], ["created_at", "2019-11-13 21:42:10.637464"], ["updated_at", "2019-11-13 21:42:10.637464"]]